sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
attiny5_diy.menu.millis_ppm.0p25=Better Or Equal 0.25% Error
attiny5_diy.menu.millis_ppm.0p25.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=2500UL

attiny5_diy.menu.millis_ppm.0p1=Better Or Equal 0.1% Error (Highest Code Use)
attiny5_diy.menu.millis_ppm.0p1.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=1000UL


# Print Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny5_diy.menu.print.default=Bin Only Supported (Smallest)
attiny5_diy.menu.print.default.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN

attiny5_diy.menu.print.Arbitrary=Full Support For Arbitrary Bases (Biggest)
attiny5_diy.menu.print.Arbitrary.build.custom_flags.print.use_base=-DPRINT_USE_BASE_ARBITRARY

attiny5_diy.menu.print.BinHexDecOct=Bin, Hex, Dec, Oct Supported
attiny5_diy.menu.print.BinHexDecOct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX -DPRINT_USE_BASE_OCT

attiny5_diy.menu.print.BinHexDec=Bin, Hex, Dec Supported
attiny5_diy.menu.print.BinHexDec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX

attiny5_diy.menu.print.Dec=Dec Only Supported
attiny5_diy.menu.print.Dec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_DEC

attiny5_diy.menu.print.Hex=Hex Only Supported
attiny5_diy.menu.print.Hex.build.custom_flags.print.use_base=-DPRINT_USE_BASE_HEX

attiny5_diy.menu.print.Oct=Oct Only Supported
attiny5_diy.menu.print.Oct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_OCT

attiny5_diy.menu.print.Bin=Bin Only Supported (Smallest)
attiny5_diy.menu.print.Bin.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN

# Serial Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny5_diy.menu.serial.HalfDuplexRW=Half Duplex, Read+Write
attiny5_diy.menu.serial.HalfDuplexRW.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX

attiny5_diy.menu.serial.HalfDuplexRWStream=Half Duplex, Read+Write Inherits Stream
attiny5_diy.menu.serial.HalfDuplexRWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny5_diy.menu.serial.HalfDuplexRStream=Half Duplex, Read Only Inherits Stream
attiny5_diy.menu.serial.HalfDuplexRStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_WRITE -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny5_diy.menu.serial.HalfDuplexWStream=Half Duplex, Write Only Inherits Stream
attiny5_diy.menu.serial.HalfDuplexWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_READ

# }}}


################################################################################
# ATtiny10
#
# There is only 1 fuse on this series of chips, it really doesn't do much.
#
# Fuse
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  See page 154 of Datasheet
#
#   avrdude DOES NOT mask the fuse bits
#
#   0xFF = Default (Reset Enabled, WDT Not Always On, Clock Not Output)
#
# Lock Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  See page 153 of Datasheet
#
#  avrdude DOES NOT mask the lock bits
#
#    0xFF = No Locking
#    0xFE = Write Locked
#    0xFC = Read and Write Locked
#
# Important: Lock bits must be set after setting the fuse.
#
################################################################################

# {{{ ############### ATtiny10 #################################################

attiny10_diy.name=ATtiny10
attiny10_diy.build.mcu=attiny10
attiny10_diy.bootloader.fuse=0xFF
attiny10_diy.bootloader.unlock_bits=0xFF
attiny10_diy.bootloader.lock_bits=0xFF
attiny10_diy.build.f_cpu=8000000L
attiny10_diy.upload.speed=57600
attiny10_diy.build.core=tiny
attiny10_diy.build.variant=tiny5_10
attiny10_diy.build.board=ATTINY10_DIY
attiny10_diy.upload.tool=diy_attiny:avrdude_nobootloader_onefuse
attiny10_diy.bootloader.tool=diy_attiny:avrdude_nobootloader_onefuse

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Only one version, no sense including this menu
# attiny10_diy.menu.version.attiny10 = ATtiny10
# attiny10_diy.menu.version.attiny10.build.mcu = attiny10

# Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# The frequency on the Reduced Core tinyAVR is set at runtime by way of a 
# prescaler (power of 2) on the internal 8MHz oscillator.
#
# See pins_arduino.h setCPUFrequency()

attiny10_diy.menu.clock.8MHz=8MHz
attiny10_diy.menu.clock.8MHz.build.f_cpu=8000000L

attiny10_diy.menu.clock.4MHz=4MHz
attiny10_diy.menu.clock.4MHz.build.f_cpu=4000000L

attiny10_diy.menu.clock.2MHz=2MHz
attiny10_diy.menu.clock.2MHz.build.f_cpu=2000000L

attiny10_diy.menu.clock.1MHz=1MHz
attiny10_diy.menu.clock.1MHz.build.f_cpu=1000000L

# These frequencies under 1MHz need some work
#  something is wrong with delayMicroSecondsAdjusted, running too fast
#  could be a memory issue maybe.

# attiny10_diy.menu.clock.500kHz=500kHz
# attiny10_diy.menu.clock.500kHz.build.f_cpu=500000L

# attiny10_diy.menu.clock.250kHz=250kHz
# attiny10_diy.menu.clock.250kHz.build.f_cpu=250000L

# attiny10_diy.menu.clock.125kHz=125kHz
# attiny10_diy.menu.clock.125kHz.build.f_cpu=125000L


# Bootloader Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# Sorry attiny10, you're too small for bootloaders.
#
# attiny10_diy.menu.boot.optiboot=Yes (Normal Arduino Serial/USB Upload)
# attiny10_diy.menu.boot.optiboot.upload.protocol=arduino
# attiny10_diy.menu.boot.optiboot.upload.maximum_size=457
# attiny10_diy.menu.boot.optiboot.bootloader.extended_fuses=0xEB
# attiny10_diy.menu.boot.optiboot.bootloader.file=optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

attiny10_diy.menu.boot.none=No (TPI Programmer Upload)
attiny10_diy.menu.boot.none.upload.maximum_size=512
attiny10_diy.menu.boot.none.bootloader.tool=diy_attiny:avrdude_nobootloader_onefuse

# Core Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#attiny10_diy.menu.core.FullCore=Millis and Tone Available
#attiny10_diy.menu.core.FullCore.build.core=tiny
#attiny10_diy.menu.core.FullCore.build.extra_flags=

# tone() is not supported on tiny10, we only have one timer
# and millis() needs it
attiny10_diy.menu.core.SmallerCore=Millis Available, No Tone
attiny10_diy.menu.core.SmallerCore.build.core=tiny
attiny10_diy.menu.core.SmallerCore.build.extra_flags=-DNO_TONE

attiny10_diy.menu.core.SmallestCore=No Millis, No Tone
attiny10_diy.menu.core.SmallestCore.build.core=tiny
attiny10_diy.menu.core.SmallestCore.build.extra_flags=-DNO_MILLIS -DNO_TONE

# Millis Accuracy
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny10_diy.menu.millis_ppm.1p6=Better Or Equal 1.666% Error (Default)
attiny10_diy.menu.millis_ppm.1p6.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=16666UL

attiny10_diy.menu.millis_ppm.50p=Better Or Equal 50% Error (Lowest Code Use)
attiny10_diy.menu.millis_ppm.50p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=500000UL

attiny10_diy.menu.millis_ppm.25p=Better Or Equal 25% Error
attiny10_diy.menu.millis_ppm.25p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=250000UL

attiny10_diy.menu.millis_ppm.10p=Better Or Equal 10% Error
attiny10_diy.menu.millis_ppm.10p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=100000UL

attiny10_diy.menu.millis_ppm.5p=Better Or Equal 5% Error
attiny10_diy.menu.millis_ppm.5p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=50000UL

attiny10_diy.menu.millis_ppm.2p5=Better Or Equal 2.5% Error
attiny10_diy.menu.millis_ppm.2p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=25000UL

